import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

const main = async () => {
  const hasCamp = await prisma.place.findMany();
  if (hasCamp.length === 0) {
    await prisma.place.createMany({
      data: [
        {
          name: 'อุทยานแห่งชาติเอราวัณ',
          image:
            'https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Erawan_Falls_National_Park.jpg/1200px-Erawan_Falls_National_Park.jpg',
          description:
            'อุทยานแห่งชาติที่มีน้ำตกเอราวัณ น้ำตก 7 ชั้นที่มีความสวยงาม น้ำใสไหลเย็น เหมาะสำหรับการเล่นน้ำตก พักผ่อนหย่อนใจ และปิคนิค',
          address: 'จังหวัดกาญจนบุรี ',
          contact: '034 584 354, 034 584 254',
          location: 'จังหวัดกาญจนบุรี',
          latitude: 14.041667,
          longitude: 99.416667,
        },
        {
          name: 'อุทยานแห่งชาติหมู่เกาะสิมิลัน',
          image:
            'https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Similan_Islands_National_Park.jpg/1200px-Similan_Islands_National_Park.jpg',
          description:
            'อุทยานแห่งชาติทางทะเลที่มีหมู่เกาะ 9 เกาะ น้ำทะเลใส หาดทรายขาวละเอียด ปะการังสวยงาม เหมาะสำหรับการดำน้ำ ชมปะการัง และพักผ่อนหย่อนใจ',
          address: 'จังหวัดพังงา',
          contact: '076 421 005, 076 421 367',
          location: 'จังหวัดพังงา',
          latitude: 8.608333,
          longitude: 97.958333,
        },
        {
          name: 'อุทยานแห่งชาติเขาใหญ่',
          image: 'อุทยานแห่งชาติเขาใหญ่-1711994427400.jpg',
          description:
            ' ขาดไม่ได้สำหรับอุทยานแห่งชาติอันดับแรกของเมืองไทย ป่าใหญ่แห่งนี้ครอบคลุมพื้นที่ถึง 4 จังหวัด ในภาคอีสานและภาคกลาง หลายสิบปีที่แล้วยังเคยเป็นที่ครั่น คร้ามถึงภยันตรายมากมาย ทั้งไข้ป่า เสือสมิง แต่เดี๋ยวนี้ใคร ๆ ก็ไปถึงได้ มีที่เที่ยวหลากหลาย ทั้ง น้ำตก ทุ่งหญ้า หน้าผา เส้นทางเดินป่า ลานกางเต็นท์ แคมป์ปิ้ง หลากหลายรสชาติการเดินทาง ใครที่ไปเที่ยวทำเก๋ที่ปากช่องแล้วไม่ได้ขึ้นเขาใหญ่ ไม่ได้เรียกว่ามาไม่ถึง แต่เรียกว่าไม่ได้มาเลยดีกว่า',
          address: 'นครนายก',
          contact: '037 312 282',
          location: 'นครนายก',
          latitude: 14.1,
          longitude: 101.366667,
        },
        {
          name: 'อุทยานแห่งชาติผาแต้ม',
          image: 'อุทยานแห่งชาติผาแต้ม-1711994478233.jpg',
          description:
            ' สุดแดนอีสานมีแนวหน้าผายาวเหยียดทอดขนานกับแม่น้ำโขง ที่จริงแล้วจุดที่มองเห็นพระอาทิตย์เป็นที่แรก ซึ่งถูกใช้อ้างอิงเวลาพระอาทิตย์ขึ้นของกรมอุตุฯ คือผาชะนะได อันเป็นสถานที่ซึ่งมองเห็นพระอาทิตย์ขึ้นก่อนใครในสยาม แต่ด้วยการเดินทางอันยากลำบาก ใครเหล่านั้นจึงมีไม่กี่คนหรอกที่จะเห็นพระอาทิตย์ก่อนคน ที่ผาแต้ม ซึ่งถนนราบเรียบไปถึงกันง่าย ๆ นั่งทอดกายชมแสงตะวันอันสดใส แต่อยากชวนให้ออกแรงกันอีกนิด ไปดูที่มาของชื่อผาแต้ม ซึ่งมาจากภาพเขียนสียุคก่อนประวัติศาสตร์ขนาดใหญ่ยาวมหึมา อยู่ใต้เพิงหน้าผาที่เรากำลังยืนอยู่ เดินลงไปไม่ไกลแค่พอเหนื่อย แต่ตอนขึ้นก็หอบนิดหน่อย',
          address: 'อุดรธานี',
          contact: '042 325 406',
          location: 'อุดรธานี',
          latitude: 17.5,
          longitude: 103.3,
        },
        {
          name: 'อุทยานแห่งชาติห้วยน้ำดัง',
          image: 'อุทยานแห่งชาติห้วยน้ำดัง-1711994393855.jpg',
          description:
            '  ขอโหวตให้ห้วยน้ำดังเป็นลานกางเต็นท์ที่ดีที่สุดในเมืองไทย เพราะได้โลเคชั่นเนินดอยสูงลดหลั่นไม่มีอะไรมาเบียดบังวิวทิวทัศน์ ใครได้มากางเต็นท์นอนในคืนวันเพ็ญจะได้ชมทิวทัศน์สว่างไสวด้วยแสงจันทร์ทาบทับทั่วหุบเขาเบื้องล่าง พอรุ่งสางก็ไปชมทะเลหมอกกันที่จุดชมวิวของอุทยาน ซึ่งว่ากันว่าทะเลหมอกสวยที่สุดในเมืองไทย มองเห็นไปไกลถึงดอยหลวงเชียงดาว ที่ดูเหมือนเกาะสูงใหญ่โผล่พ้นมหาสมุทรแห่งม่านหมอก',
          address: 'เชียงใหม่',
          contact: '053 338 334',
          location: 'เชียงใหม่',
          latitude: 19.5,
          longitude: 99.0,
        },
        {
          name: 'อุทยานแห่งชาติเขาสก',
          image:
            'https://upload.wikimedia.org/wikipedia/commons/d/d2/1022_KhaoSokNationalPark_2.jpg',
          description:
            'อุทยานแห่งชาติเขาสก อุทยานแห่งชาติที่มีป่าที่สวยงาม และมีทะเลสาบที่มีน้ำใส สามารถทำกิจกรรมต่าง ๆ ได้ เช่น ปีนเขา ล่องเรือ และเดินป่า',
          address: 'จังหวัดสุราษฎร์ธานี',
          contact: '077 395 293',
          location: 'จังหวัดสุราษฎร์ธานี',
          latitude: 8.916667,
          longitude: 98.466667,
        },
        {
          name: 'อุทยานแห่งชาติแก่งกระจาน',
          image:
            'https://cbtthailand.dasta.or.th/upload-file-api/Resources/RelateAttraction/Images/RAT760014/1.jpeg',
          description:
            'อุทยานแห่งชาติแก่งกระจาน เป็นอุทยานแห่งชาติทางธรรมชาติที่สวยงามแห่งหนึ่งในประเทศไทย ตั้งอยู่ในเขตอำเภอแก่งกระจาน จังหวัดเพชรบุรี มีเนื้อที่ประมาณ 348 ตารางกิโลเมตร ครอบคลุมพื้นที่ป่าเขาสูงและลำธารน้ำกระจานที่สวยงาม',
          address: 'จังหวัดเพชรบุรี',
          contact: '032 425 035',
          location: 'จังหวัดเพชรบุรี',
          latitude: 13.1,
          longitude: 99.9,
        },
      ],
    });
  }
};

main()
  .then(async () => {
    await prisma.$disconnect();
  })
  .catch(async (e) => {
    console.error(e);
    await prisma.$disconnect();
    process.exit(1);
  });
